# CannotCreateMullionReference Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CreationFailures..::..CannotCreateMullionReference Property
BuiltInFailures..::..CreationFailures Class See Also
---
Can't create Curtain Wall Mullion. The grid segment for the Mullion is probably too small.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCreateMullionReference { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCreateMullionReference As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCreateMullionReference {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CreationFailures Class
Autodesk.Revit.DB Namespace